Repository: loginom/site-articles-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: модальное окно (значение по умолчанию);
en: modal window (default value);

source: можно выбрать режим представления мастера «Выбор таблицы» или «SQL-запрос»;
en: it became possible to select the "Table selection" or "SQL query" wizard representation mode;

source: на панели Производные компоненты для текущего модуля добавлено контекстное меню с пунктом «Перейти к производным компонентам»;
en: the context menu with "Go to derived component" option was added on the Derived Components panel for the current module;

source: на странице настройки соответствия между столбцами в мастере Импорта из базы данных или на этапе активации узла Импорт из базы данных, в котором задан SELECT-запрос, возвращающий поля с типом JSON (#9248).
en: on the page of columns mapping configuration in Import from database wizard or at the stage of Import from database node activation in which SELECT request is set returning the fields with JSON type (#9248).

source: одиночный и комбинированный режимы — копируется текущее выбранное значение, при вставке обрабатывается только первое строковое значение, остальные игнорируются, успешно распознанное значение становится выделенным, на него прокручивается таблица (#9107).
en: single and combined modes - the current selected value is copied, only the first row value is processed while pasting, the other ones are ignored, the successfully captured value becomes the selected one, the table is scrolled to reach it (#9107).

source: панель фильтра измерения «Куба» сворачивалась при возникновении ошибки во время копирования или вставки (#9108);
en: the "Cube" dimension filter bar was collapsed when an error occurred during copying or pasting (#9108);

source: подключения к Oracle 18c и старше без использования клиента;
en: connection to Oracle 18c иand higher without client use;

source: потеря точности при копировании и вставке дат и чисел в фильтре измерения «Куба» (#9106);
en: precision loss while copying and pasting dates and figures in the "Cube" dimension filter(#9106);

source: появилась возможность задать имя таблицы через переменные;
en: it became possible to set the table name via variables;

source: появилась возможность показа всех заголовков или только заголовков 1-го уровня в кросс-диаграммах;
en: It became possible to display all headers or only the 1st level headers in the cross charts.

source: появилась возможность сохранять максимально полный развернутый уровень измерений Куба;
en: It became possible to save maximumally full detailed level of the Cube dimensions.

source: при загрузке пакета, созданного до версии 6.4.0, в котором использовалось наследуемое подключение REST-сервис и если в наследнике список GET параметров был очищен.
en: when loading the package created up to 6.4.0 version in which the inherited REST service connection was used, and if GET list of parameters was cleared in the descendant.

source: при перетаскивании окна приложения с одного экрана (большего размера) на другой, часть окна перекрывалась серой панелью (#9024);
en: when dragging the application window from one screen (the larger one) to another one, a part of the window was covered with the grey panel (#9024);

source: при перетаскивании окна приложения с экрана большего размера (~4К) на меньший, окно не изменяло масштаб автоматически (#9091);
en: when dragging the application window from the larger screen (~4К) to the smaller one, the window didn't change the scale automatically (#9091);

source: реализована вставка значений в фильтр измерений из буфера обмена;
en: Insertion of values to the dimension filter from the clipboard was implemented.

source: символов (#7583).
en: characters (#7583).

source: символов)) возникала ошибка браузера "Aw, Snap!
en: characters)) the following browser error occurred: "Aw, Snap!

source: символы русского алфавита заменяются по таблице замен на латинские символы или их комбинацию;
en: the Russian alphabet characters are replaced with the Latin characters or their combination according to the replacement table;

source: стало:
en: after:

source: строк не больше 65536;
en: not exceeding 65536 rows

source: строка даты/времени с 25/12/04/12:44:54 на 25/12/04 12:44:54.
en: the date/time string was changed from 25/12/04/12:44:54 to25/12/04 12:44:54.

source: таблицы, поля и переменные можно перетаскивать в редактор SQL кода drag&drop;
en: it is possible to drag tables, fields and variables to drag&drop SQL code editor;

source: у производных компонентов добавлен пункт «Перейти к производному компоненту».
en: "Go to derived component" option was added for the derived components.

source: уменьшен размер шрифта заголовков фактов и измерений, а также высота ячеек Куба;
en: The font size of the measures and dimensions headers was decreased as well as the Cube cells height.

source: ускорена загрузка объектов БД в дерево объектов.
en: loading of DB objects to the tree of objects became faster.

source: установлен флаг Кэшировать все данные;
en: Cache all data checkbox was selected;

source: формат с DD/MM/YY/HH:NN:SS заменен на DD/MM/YY HH:NN:SS,
en: format with DD/MM/YY/HH:NN:SS was replaced with DD/MM/YY HH:NN:SS,

source: формируются с учётом протокола, по которому выполнено подключение.
en: are generated taking into account the protocol via which connection is established.
